---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightShape.Dispose
source: html/342f5f07-befa-c392-35ec-83ad48763628.htm
---
# Autodesk.Revit.DB.Lighting.LightShape.Dispose Method

Releases all resources used by the LightShape

## Syntax (C#)
```csharp
public void Dispose()
```